nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1181/drivers/fsl_dcdc.h
/*
 * Copyright 2021-2022 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __FSL_DCDC_H__
#define __FSL_DCDC_H__

#include "fsl_common.h"

/*!
 * @addtogroup dcdc_soc
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @brief DCDC driver version. */
#define FSL_DCDC_DRIVER_VERSION (MAKE_VERSION(2, 0, 1)) /*!< Version 2.0.1. */

/*! @brief The array of VDD1P0 target voltage. */
#define VDD1P0_TARGET_VOLTAGE                                                                                         \
    {                                                                                                                 \
        600, 625, 650, 675, 700, 725, 750, 775, 800, 825, 850, 875, 900, 925, 950, 975, 1000, 1025, 1050, 1075, 1100, \
            1125, 1150, 1175, 1200, 1225, 1250, 1275, 1300, 1325, 1350, 1375                                          \
    }

/*! @brief The array of VDD1P8 target voltage. */
#define VDD1P8_TARGET_VOLTAGE                                                                                       \
    {                                                                                                               \
        1500, 1525, 1550, 1575, 1600, 1625, 1650, 1675, 1700, 1725, 1750, 1775, 1800, 1825, 1850, 1875, 1900, 1925, \
            1950, 1975, 2000, 2025, 2050, 2075, 2100, 2125, 2150, 2175, 2200, 2225, 2250, 2275                      \
    }

/*!
 * @brief The enumeration of DCDC status flags.
 */
enum _dcdc_status_flags
{
    kDCDC_AlreadySettledStatusFlag = DCDC_REG0_STS_DC_OK_MASK, /*!< Indicate DCDC status.
                                                            1'b1: DCDC already settled
                                                            1'b0: DCDC is settling. */
};

/*!
 * @brief CORE slice.
 */
typedef enum _dcdc_core_slice
{
    kDCDC_CORE0 = 0x0U, /*!< CORE slice 0. */
    kDCDC_CORE1 = 0x1U, /*!< CORE slice 1. */
} dcdc_core_slice_t;

/*!
 * @brief DCDC control mode, including software control mode and GPC control mode.
 */
typedef enum _dcdc_control_mode
{
    kDCDC_SoftwareControl = 0U, /*!< Controlled by software. */
    kDCDC_GPCControl      = 1U, /*!< Controlled by GPC. */
} dcdc_control_mode_t;

/*!
 * @brief DCDC trim input mode, including sample trim input and hold trim input.
 */
typedef enum _dcdc_trim_input_mode
{
    kDCDC_SampleTrimInput = 0U, /*!< Sample trim input. */
    kDCDC_HoldTrimInput   = 1U, /*!< Hold trim input. */
} dcdc_trim_input_mode_t;

/*!
 * @brief The enumeration VDD1P0's target voltage value.
 */
typedef enum _dcdc_1P0_target_vol
{
    kDCDC_1P0Target0P6V = 0U, /*!< The target voltage value of VDD1P0 is 0.6V. */
    kDCDC_1P0Target0P625V,    /*!< The target voltage value of VDD1P0 is 0.625V. */
    kDCDC_1P0Target0P65V,     /*!< The target voltage value of VDD1P0 is 0.65V. */
    kDCDC_1P0Target0P675V,    /*!< The target voltage value of VDD1P0 is 0.675V. */

    kDCDC_1P0Target0P7V,   /*!< The target voltage value of VDD1P0 is 0.7V. */
    kDCDC_1P0Target0P725V, /*!< The target voltage value of VDD1P0 is 0.725V. */
    kDCDC_1P0Target0P75V,  /*!< The target voltage value of VDD1P0 is 0.75V. */
    kDCDC_1P0Target0P775V, /*!< The target voltage value of VDD1P0 is 0.775V. */

    kDCDC_1P0Target0P8V,   /*!< The target voltage value of VDD1P0 is 0.8V. */
    kDCDC_1P0Target0P825V, /*!< The target voltage value of VDD1P0 is 0.825V. */
    kDCDC_1P0Target0P85V,  /*!< The target voltage value of VDD1P0 is 0.85V. */
    kDCDC_1P0Target0P875V, /*!< The target voltage value of VDD1P0 is 0.875V. */

    kDCDC_1P0Target0P9V,   /*!< The target voltage value of VDD1P0 is 0.9V. */
    kDCDC_1P0Target0P925V, /*!< The target voltage value of VDD1P0 is 0.925V. */
    kDCDC_1P0Target0P95V,  /*!< The target voltage value of VDD1P0 is 0.95V. */
    kDCDC_1P0Target0P975V, /*!< The target voltage value of VDD1P0 is 0.975V. */

    kDCDC_1P0Target1P0V,   /*!< The target voltage value of VDD1P0 is 1.0V. */
    kDCDC_1P0Target1P025V, /*!< The target voltage value of VDD1P0 is 1.025V. */
    kDCDC_1P0Target1P05V,  /*!< The target voltage value of VDD1P0 is 1.05V. */
    kDCDC_1P0Target1P075V, /*!< The target voltage value of VDD1P0 is 1.075V. */

    kDCDC_1P0Target1P1V,   /*!< The target voltage value of VDD1P0 is 1.1V. */
    kDCDC_1P0Target1P125V, /*!< The target voltage value of VDD1P0 is 1.125V. */
    kDCDC_1P0Target1P15V,  /*!< The target voltage value of VDD1P0 is 1.15V. */
    kDCDC_1P0Target1P175V, /*!< The target voltage value of VDD1P0 is 1.175V. */

    kDCDC_1P0Target1P2V,   /*!< The target voltage value of VDD1P0 is 1.2V. */
    kDCDC_1P0Target1P225V, /*!< The target voltage value of VDD1P0 is 1.225V. */
    kDCDC_1P0Target1P25V,  /*!< The target voltage value of VDD1P0 is 1.25V. */
    kDCDC_1P0Target1P275V, /*!< The target voltage value of VDD1P0 is 1.275V. */

    kDCDC_1P0Target1P3V,           /*!< The target voltage value of VDD1P0 is 1.3V. */
    kDCDC_1P0Target1P325V,         /*!< The target voltage value of VDD1P0 is 1.325V. */
    kDCDC_1P0Target1P35V,          /*!< The target voltage value of VDD1P0 is 1.35V. */
    kDCDC_1P0Target1P375V = 0x1FU, /*!< The target voltage value of VDD1P0 is 1.375V. */
} dcdc_1P0_target_vol_t;

/*!
 * @brief The enumeration VDD1P8's target voltage value.
 */
typedef enum _dcdc_1P8_target_vol
{
    kDCDC_1P8Target1P5V = 0U, /*!< The target voltage value of VDD1P8 is 1.5V. */
    kDCDC_1P8Target1P525V,    /*!< The target voltage value of VDD1P8 is 1.525V. */
    kDCDC_1P8Target1P55V,     /*!< The target voltage value of VDD1P8 is 1.55V. */
    kDCDC_1P8Target1P575V,    /*!< The target voltage value of VDD1P8 is 1.575V. */

    kDCDC_1P8Target1P6V,   /*!< The target voltage value of VDD1P8 is 1.6V. */
    kDCDC_1P8Target1P625V, /*!< The target voltage value of VDD1P8 is 1.625V. */
    kDCDC_1P8Target1P65V,  /*!< The target voltage value of VDD1P8 is 1.65V. */
    kDCDC_1P8Target1P675V, /*!< The target voltage value of VDD1P8 is 1.675V. */

