nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1181/drivers/fsl_dcdc.h
    kDCDC_1P8Target1P7V,   /*!< The target voltage value of VDD1P8 is 1.7V. */
    kDCDC_1P8Target1P725V, /*!< The target voltage value of VDD1P8 is 1.725V. */
    kDCDC_1P8Target1P75V,  /*!< The target voltage value of VDD1P8 is 1.75V. */
    kDCDC_1P8Target1P775V, /*!< The target voltage value of VDD1P8 is 1.775V. */

    kDCDC_1P8Target1P8V,   /*!< The target voltage value of VDD1P8 is 1.8V. */
    kDCDC_1P8Target1P825V, /*!< The target voltage value of VDD1P8 is 1.825V. */
    kDCDC_1P8Target1P85V,  /*!< The target voltage value of VDD1P8 is 1.85V. */
    kDCDC_1P8Target1P875V, /*!< The target voltage value of VDD1P8 is 1.875V. */

    kDCDC_1P8Target1P9V,   /*!< The target voltage value of VDD1P8 is 1.9V. */
    kDCDC_1P8Target1P925V, /*!< The target voltage value of VDD1P8 is 1.925V. */
    kDCDC_1P8Target1P95V,  /*!< The target voltage value of VDD1P8 is 1.95V. */
    kDCDC_1P8Target1P975V, /*!< The target voltage value of VDD1P8 is 1.975V. */

    kDCDC_1P8Target2P0V,   /*!< The target voltage value of VDD1P8 is 2.0V. */
    kDCDC_1P8Target2P025V, /*!< The target voltage value of VDD1P8 is 2.025V. */
    kDCDC_1P8Target2P05V,  /*!< The target voltage value of VDD1P8 is 2.05V. */
    kDCDC_1P8Target2P075V, /*!< The target voltage value of VDD1P8 is 2.075V. */

    kDCDC_1P8Target2P1V,   /*!< The target voltage value of VDD1P8 is 2.1V. */
    kDCDC_1P8Target2P125V, /*!< The target voltage value of VDD1P8 is 2.125V. */
    kDCDC_1P8Target2P15V,  /*!< The target voltage value of VDD1P8 is 2.15V. */
    kDCDC_1P8Target2P175V, /*!< The target voltage value of VDD1P8 is 2.175V. */

    kDCDC_1P8Target2P2V,           /*!< The target voltage value of VDD1P8 is 2.2V. */
    kDCDC_1P8Target2P225V,         /*!< The target voltage value of VDD1P8 is 2.225V. */
    kDCDC_1P8Target2P25V,          /*!< The target voltage value of VDD1P8 is 2.25V. */
    kDCDC_1P8Target2P275V = 0x1FU, /*!< The target voltage value of VDD1P8 is 2.275V. */
} dcdc_1P8_target_vol_t;

/*!
 * @brief The current bias of low power comparator.
 */
typedef enum _dcdc_comparator_current_bias
{
    kDCDC_ComparatorCurrentBias50nA  = 0U, /*!< The current bias of low power comparator is 50nA. */
    kDCDC_ComparatorCurrentBias100nA = 1U, /*!< The current bias of low power comparator is 100nA. */
    kDCDC_ComparatorCurrentBias200nA = 2U, /*!< The current bias of low power comparator is 200nA. */
    kDCDC_ComparatorCurrentBias400nA = 3U, /*!< The current bias of low power comparator is 400nA. */
} dcdc_comparator_current_bias_t;

/*!
 * @brief The threshold if peak current detection.
 */
typedef enum _dcdc_peak_current_threshold
{
    kDCDC_PeakCurrentRunMode250mALPMode1P5A = 0U, /*!< Over peak current threshold in low power mode is 250mA,
                                                      in run mode is 1.5A */
    kDCDC_PeakCurrentRunMode200mALPMode1P5A,      /*!< Over peak current threshold in low power mode is 200mA,
                                                           in run mode is 1.5A */
    kDCDC_PeakCurrentRunMode250mALPMode2A,        /*!< Over peak current threshold in low power mode is 250mA,
                                                             in run mode is 2A */
    kDCDC_PeakCurrentRunMode200mALPMode2A,        /*!< Over peak current threshold in low power mode is 200mA,
                                                             in run mode is 2A */
} dcdc_peak_current_threshold_t;

/*!
 * @brief Oscillator clock option.
 */
typedef enum _dcdc_clock_source
{
    kDCDC_ClockAutoSwitch  = 0U, /*!< Automatic clock switch from internal oscillator to external clock. */
    kDCDC_ClockInternalOsc = 1U, /*!< Use internal oscillator. */
    kDCDC_ClockExternalOsc = 2U, /*!< Use external 24M crystal oscillator. */
} dcdc_clock_source_t;

/*!
 * @brief Voltage output option.
 */
typedef enum _dcdc_voltage_output_sel
{
    kDCDC_VoltageOutput1P8 = 0U, /*!< 1.8V output. */
    kDCDC_VoltageOutput1P0 = 1U, /*!< 1.0V output. */
} dcdc_voltage_output_sel_t;

/*!
 * @brief Configuration for DCDC.
 */
typedef struct _dcdc_config
{
    dcdc_control_mode_t controlMode;      /*!< DCDC control mode. */
    dcdc_trim_input_mode_t trimInputMode; /*!< Hold trim input. */
} dcdc_config_t;

/*!
 * @brief Configuration for min power setting.
 */
typedef struct _dcdc_min_power_config
{
    bool enableUseHalfFreqForContinuous; /*!< Set DCDC clock to half frequency for the continuous mode. */
} dcdc_min_power_config_t;

/*!
 * @brief Configuration for DCDC detection.
 */
typedef struct _dcdc_detection_config
{
    bool enableXtalokDetection;               /*!< Enable xtalok detection circuit. */
    bool powerDownOverVoltageVdd1P8Detection; /*!< Power down over-voltage detection comparator for VDD1P8. */
    bool powerDownOverVoltageVdd1P0Detection; /*!< Power down over-voltage detection comparator for VDD1P0. */
    bool powerDownLowVoltageDetection;        /*!< Power down low-voltage detection comparator. */
    bool powerDownOverCurrentDetection;       /*!< Power down over-current detection. */
} dcdc_detection_config_t;

/*!
 * @brief Configuration for the loop control.
 */
typedef struct _dcdc_loop_control_config
{
    bool enableCommonHysteresis;         /*!< Enable hysteresis in switching converter common mode analog comparators.
                                              This feature will improve transient supply ripple and efficiency. */
    bool enableCommonThresholdDetection; /*!< Increase the threshold detection for common mode analog comparator. */
    bool enableDifferentialHysteresis;   /*!< Enable hysteresis in switching converter differential mode analog
                                              comparators. This feature will improve transient supply ripple and
                                              efficiency. */
    bool enableDifferentialThresholdDetection; /*!< Increase the threshold detection for differential mode analog
                                                    comparators. */
    bool enableInvertHysteresisSign;           /*!< Invert the sign of the hysteresis in DC-DC analog comparators. */
    bool enableRCThresholdDetection;           /*!< Increase the threshold detection for RC scale circuit. */
    uint32_t enableRCScaleCircuit;      /*!< Available range is 0~7. Enable analog circuit of DC-DC converter to respond
                                             faster under transient load conditions. */
    uint32_t complementFeedForwardStep; /*!< Available range is 0~7. Two's complement feed forward step in duty cycle in
                                           the switching DC-DC converter. Each time this field makes a transition from
                                           0x0, the loop filter of the DC-DC converter is stepped once by a value
                                           proportional to the change. This can be used to force a certain control loop
                                           behavior, such as improving response under known heavy load transients. */
    uint32_t controlParameterMagnitude; /*!< Available range is 0~15. Magnitude of proportional control parameter in the
                                           switching DC-DC converter control loop. */
    uint32_t integralProportionalRatio; /*!< Available range is 0~3.Ratio of integral control parameter to proportional
                                           control parameter in the switching DC-DC converter, and can be used to
                                           optimize efficiency and loop response. */
} dcdc_loop_control_config_t;

/*!
 * @brief Configuration for DCDC internal regulator.
 */
typedef struct _dcdc_internal_regulator_config
{
    uint32_t feedbackPoint; /*!< Available range is 0~3. Select the feedback point of the internal regulator. */
} dcdc_internal_regulator_config_t;

